-- https://docs.spring.io/spring-boot/docs/current/reference/html/howto.html#howto.data-initialization.using-basic-sql-scripts

-- user roles
INSERT INTO roles (id, role)
VALUES (1, 'ADMIN');
INSERT INTO roles (id, role)
VALUES (2, 'MODERATOR');
INSERT INTO roles (id, role)
VALUES (3, 'USER');

-- some test users
INSERT INTO users (id, username, first_name, last_name, date_birth,email ,password, role_id)
VALUES (1, 'Admin', 'Petar', 'Petrov', '2004-01-22' ,'admin@arsenal-bulgaria.com' , '123' , 1);

INSERT INTO users (id, username, first_name, last_name, date_birth,email ,password , role_id)
VALUES (2, 'Ivan87', 'Ivan', 'Ivanov', '1987-01-22' ,'ivan87@abv.bg' , '123' , 2);

INSERT INTO users (id, username, first_name, last_name, date_birth,email ,password , role_id)
VALUES (3, 'user1', 'Mario', 'Vladimirov', '1986-06-15' ,'mariovl@abv.bg' , '123' , 3);



-- insert  products
INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949788/shop/cards_lnzojy.jpg' , 'Playing cards "Arsenal Bulgaria"'  , 3.00 , 30);

INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949789/shop/keyRing_uirpfo.jpg' , 'Key ring "15 years ASCB"'  , 8.00 , 25);

INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949788/shop/siliconeBracelet_j321rx.jpg' , 'Silicone bracelet "Arsenal Bulgaria"'  , 10.00 , 65);

INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949787/shop/backpack_ninmfv.jpg' , 'Backpack "Arsenal Bulgaria"'  , 35.00 , 15);

INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949787/shop/tshirtPolo_cbmdym.jpg' , 'Т-shirt "Bulgarian Gooners"'  , 29.00 , 25);

INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949786/shop/book_gpcr5u.jpg' , 'Ian Wright - A Life In Football'  , 68.00 , 55);

INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949786/shop/glass_up1yxk.jpg' , 'Beer glass "Arsenal Bulgaria" 420ml'  , 6.00 , 23);

INSERT INTO products  (url_picture,product_name,price,count_product)
VALUES ('https://res.cloudinary.com/mariovl/image/upload/v1635949786/shop/pencil_f31naj.jpg' , 'Pencil case "Arsenal Bulgaria"'  , 8.00 , 42);

-- insert news
INSERT INTO news (description , topic , url_picture_news , user_id , local_date_news)
VALUES ('Някои твърдят, че футбола е „мъжка“ игра. Оооо, тeзи хора явно никога не са гледали как го играят представителките на „нежния“ пол. Нещо повече, те със сигурност не са били на игрищата на „Грийнспорт“ в столичния квартал Слатина миналата събота. А, трябваше! Защото, така щяха да усетят една истинска страст, неподправена емоция и хъс, които много често липсват в играта на мъжете в тяхната т.н. „мъжка“ игра и които са присъщи само и единствено на „футболните амазонки“. Понякога тези състояния на духа липсват и на нас като привърженици в презадоволената от футбол всяка една съботa! А, съботите са за футбол, но оня истинският, който ни вдъхнови в най-ранна възраст, а после ни събра в организацията „Арсенал България“. Такъв един истински, какъвто се игра на 02 октомври 2021 година от 8-те отбора, които се включиха във вече станалия традиционен турнир за дами любителки. Когато преди няколко години се разгоря един епичен спор между хора от УС и представители на клонове за прословутото точкуване на играещите във Форумната лига и някак еретично се прокрадна идея и за дамски тим, то едва ли и най-смелите мечтатели като Петко Александров(инициатор и треньор на ASCB Ladies) са очаквали, че 4 години по-късно новината за това мероприятие ще стои в спортните медии до имената на Пеп и Клоп. При това напълно заслужено. „В началото бе словото“, както обичаме да си говорим с Петко, защото именно споменатата словесна „дискусия“ (доста меко определение за онзи вербален поток преди години) се роди прекрасната идея да създадем наша любителска дамска футболна формация с първоначален замисъл да подкрепим благотворителна кауза. Това си беше достатъчна мотивация на ентусиазирани момичета да се включат в една непозната за тях област изцяло извън зоната им на комфорт. Още по-приятно за нас е, че магията на играта владее десетки други дами, които вече години наред горят с играта и се включват в нашето скромно мероприятие. Нещо повече, това създаде много нови запознанства и приятелства, а само, който не е гледал състезателния хъс на дамите, не може да разбере с каква страст се хвърлят в двубоите. Именно този интерес към играта и правенето на добро мотивира УС да организира и есенно издание на надпреварата, която смело можем да наречем изключително успешна и гордо да отбележим, как се превърна в част от футболния календар, оня календар облечен в аматьорското начало, но точно онова начало, което води аматьорите до победи над професионалистите. Защото всеки един участвал в организирането, в самите футболни двубои и дарил е истински победител. Един турнир в който големият победител е правенето на добро с любов, каквото е и френското значение на думата „amateur“. В слънчевата събота на 02 октомври в надпреварата се включиха рекордните до момента 8 отбора в лицето на организаторите от ASCB Ladies, ФК „Атлетико“, „EnJoy“, „Лъвиците на Лео“, „Национал НСА“, „PwC“, „Скрити Лимонки“ и „Торнадо лейдис“, както и доброволки дошли с желание да се забавляват и помогнат на нашите партньори от сдружение „Деца с онкохематологични заболявания“. Отборите бяха разпределени в две групи с по 4 състава, като тегленето на жребия и самите срещи бяха транслирани на живо в страницата на АМФЛ във Фейсбук, а това в добавка със съдиите и лекарите накара прекрасните Дами да се почувстват на една истинска и конкурентна футболна арена. По време на турнира видяхме много голове, страхотно индивидуално майсторство, изгаряща енергия, колективен дух и стремеж за отборен резултат. А, когато видиш, как момичета, които в ежедневието носят токчета и елегантни чанти, преминават съперника с финеса на Пирес, стрелят с мощта и точността на Тиери Анри, а в единоборствата са твърди като Адамс и Киоун, то няма как да не изпаднеш в екстаз и да не им отдадеш аплаузи за удоволствието, което доставят. Удоволствие за нас и уважение от вкаралия на Ювентус Екундайо Джайеоба, който също погледа част зрелището на терена. И тук не искаме да говорим за спортни резултати и класиране, а за емоцията на момичетата, за уважението към противника, за извиненията които бяха поднесени при неминуемите инциденти, когато има толкова много емоция и страст. Всички срещи ни припомниха атмосферата на едно вече позабравено очарование във футбола, защото водещата мотивация бе единствено чистосърдечното желание да играят футбол. А, това и липсата на финансови облаги създаде за пореден път една истинска футболна атмосфера, която се превръща в празник за всички нас. Умиление и възхищение предизвиква и това как момичета като Теди от Пловдив и Сандра от Асеновград бяха дошли да играят за честта на ASCB Ladies и в името на една велика кауза, каквато е правенето на добро. Именно доброто и това да научим на добри дела присъстващите на съревнованието деца е и наша цел и призвание, които надхвърлят идеята за един фен клуб в неговия общоприет формат. Идея, която „Арсенал България“ отдавна е превърнал в свое мото. Не би било честно, да не споменем, че EnJoy спечелиха за втори пореден път надпреварата, както и събраните рекордни средства от зрители и партньорите спомоществователи в размер на 13 190,00 лева. Всичко това и усмивките на малките „сървайвари“ са нашата мотивация и катализатор, които ни карат да очакваме с нетърпение следващата надпревара през май 2022 година. От името на ASCB искаме да благодарим на всички наши патньори в лицето на „SiLVER COURT“, „Рейнарс Алуминиум“, фондация „Продължи доброто“ „Eddy’s bakery“, „Еаt &Go“, „Стада България“, „Димиев Студио“, „Скрити лимонки“ и тяхната кампания „Книги за усмивки“, „Веспа Клуб 2% Brothers България“, АМФЛ, спортен комплекс „Грийнспорт“, БНТ и десетките привърженици по трибуните. За всички тях важи в пълна степен и девиза на Дейвид „Роки“ Рокясъл: „Помни кой си, какво си и кого представляваш!“, защото това което те направиха за децата в нужда е това, което ги определя като хора. А, за нас като фен клуб този турнир и издадената автобиография на Иън Райт правят 2021 една забележителна година!' ,
'Дамите - футбол, вдъхновение, страст и благотворителност!', 'https://res.cloudinary.com/mariovl/image/upload/v1635954879/news/woman_z6w1fm.jpg' , 2 , '2021-09-22' );

INSERT INTO news (description , topic , url_picture_news , user_id , local_date_news)
VALUES ('Съставите на Брайтън и Арсенал завършиха при резултат 0:0 в мач от 7 кръг на Висшата лига. С оглед показаното от двата отбора на терена, гостите от Лондон би трябвало да сметнат двубоя като спечелена точка, а не като загубени две. Повечето опасности под проливните дъждове в южна Англия бяха пред вратата на Аарън Рамсдейл, който за пореден път изнесе стабилен двубой и запази мрежата си суха. Това впрочем бе и 3 чиста мрежа за Рамсдейл в 4 мача във Висшата лига. Неговото представяне продължава да бъде на високо ниво и да вдъхва сигурност на отбраната пред него. Домакините от Брайтън затрудниха максимално своят съперник и не му оставиха почти никакви шансове, а с най-чистият такъв се отчете Смит Роу, който можеше да отбележи в края на мача. С тази си спечелена точка, Арсенал вече събра актив от общо 10 и в момента заема 9 позиция във временното класиране. Повече подробности от мача снощи в следващите редове.Думите на Микел Артета след края на двубоя: ''''Мисля, че това е спечелена точка, защото не заслужавахме нищо повече от това. Като цяло се защитавахме на високо ниво в двубоя, особено в заключителните 15-20 минути. Не бих могъл да кажа, обаче, че сме контролирали нещата на терена. Наложи се да положим големи усилия за да пробием пресата на противника. Също така и не разполагахме с чисти пространства по терена като цяло, а това усложни съвсем нещата за нас. Все пак запазихме вратата си суха, а с основен принос за това е Аарън Рамсдейл. Той се представя страхотно и проявява страхотен професионализъм. Освен това, разполага с характер и доказва това, че може да работи под напрежение и то в голям клуб, какъвто е Арсенал.В следващият си двубой, Арсенал приема Кристъл Палас, воден от не кой да е, а Патрик Виейра. Двубоя ще бъде изигран на 18 октомври, понеделник, от 22:00 часа българско време. С това и днешният ни материал завършва. Екипа на Арсенал България ви пожелава приятен завършек на уикенда.' ,
'Брайтън и Арсенал не излъчиха победител на южния бряг', 'https://res.cloudinary.com/mariovl/image/upload/v1635954879/news/brighton_wgihvb.jpg' , 2 , '2004-01-25' );

--insert topic of members
INSERT INTO members_topic (description , title , url_topic_picture)
VALUES ('Това е първото гостуване на ФК Арсенал в България. 2100 привърженици на "Арсенал" изпълниха гостуващият сектор на Националния стадион и над 200 члена на фенклуба бяха там.' ,
'Арсенал в България' , 'https://res.cloudinary.com/mariovl/image/upload/v1635955888/membership_topic/ludo_rmhtrv.jpg');

INSERT INTO members_topic (description , title , url_topic_picture)
VALUES ('Последното групово гостуване на фенклуба на Арсенал-България преди пандемията.Групата от България беше над 150 члена на Фенклуб Арсенал-България.' ,
        'Олимпиакос - Арсенал' , 'https://res.cloudinary.com/mariovl/image/upload/v1635955889/membership_topic/olymp_rtlz2x.jpg');

INSERT INTO members_topic (description , title , url_topic_picture)
VALUES ('Снимка изпратена изпратена от член на фенклуба. Разказа ,че това е най-невероятното нещо което му се е случвало.' ,
        'Арсенал - Тотнъм' , 'https://res.cloudinary.com/mariovl/image/upload/v1635955888/membership_topic/totn_agsydw.jpg');

